OpenAtomFoundation/TobudOS/platform/vendor_bsp/nordic/nRF5_SDK_15.3.0/examples/iot/coap/lwip/server_block/main.c
    err_code = coap_message_remote_addr_set(p_response, &p_request->remote);
    APP_ERROR_CHECK(err_code);

    memcpy(&p_response->remote, &p_request->remote, sizeof(coap_remote_t));

    err_code = coap_message_opt_uint_add(p_response, COAP_OPT_CONTENT_FORMAT,
                                         COAP_CT_APP_LINK_FORMAT);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_payload_set(p_response, m_well_known_core,
                                        strlen((char *)m_well_known_core));
    APP_ERROR_CHECK(err_code);

    uint32_t msg_handle;
    err_code = coap_message_send(&msg_handle, p_response);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_delete(p_response);
    APP_ERROR_CHECK(err_code);
}


static void large_resource_callback(coap_resource_t * p_resource, coap_message_t * p_request)
{
    coap_message_conf_t response_config;
    memset(&response_config, 0x00, sizeof(coap_message_conf_t));

    if (p_request->header.type == COAP_TYPE_NON)
    {
        response_config.type = COAP_TYPE_NON;
    }
    else if (p_request->header.type == COAP_TYPE_CON)
    {
        response_config.type = COAP_TYPE_ACK;
    }

    response_config.code = COAP_CODE_405_METHOD_NOT_ALLOWED;

    // Copy message ID.
    response_config.id = p_request->header.id;
    // Set local port number to use.
    response_config.port.port_number = LOCAL_PORT_NUM;
    // Copy token.
    memcpy(&response_config.token[0], &p_request->token[0], p_request->header.token_len);
    // Copy token length.
    response_config.token_len = p_request->header.token_len;

    coap_message_t * p_response;
    uint32_t err_code = coap_message_new(&p_response, &response_config);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_remote_addr_set(p_response, &p_request->remote);
    APP_ERROR_CHECK(err_code);

    // Handle request.
    switch (p_request->header.code)
    {
        case COAP_CODE_PUT:
            {
                uint8_t option_index;
                if (coap_message_opt_index_get(&option_index, p_request, COAP_OPT_BLOCK1) == NRF_SUCCESS)
                {
                    // Locate the option by index.
                    coap_option_t * p_block1_opt = &p_request->options[option_index];

                    // Decode option value into a uint32_t.
                    uint32_t block1_opt_value_raw;
                    err_code = coap_opt_uint_decode(&block1_opt_value_raw,
                                                    p_block1_opt->length,
                                                    p_block1_opt->p_data);
                    APP_ERROR_CHECK(err_code);

                    // Decode uint32_t value into block1 option structure.
                    coap_block_opt_block1_t block1_request;
                    err_code = coap_block_opt_block1_decode(&block1_request, block1_opt_value_raw);

                    if (err_code == (NRF_ERROR_INVALID_DATA | IOT_COAP_ERR_BASE))
                    {
                        // value 7 is used for size indicator.
                        // Reply with 4.00 Bad Request.
                        p_response->header.code = COAP_CODE_400_BAD_REQUEST;
                    }
                    else if (err_code != NRF_SUCCESS)
                    {
                        // If error code is not expected, raise it.
                        APP_ERROR_CHECK(err_code);
                    }
                    else
                    {
                        static char msg_buffer[COAP_PREFERRED_BLOCK_SIZE + 1];

                        strncpy((char *)msg_buffer, (char *)p_request->p_payload, p_request->payload_len);
                        msg_buffer[p_request->payload_len] = '\0';
                        APPL_LOG("[CoAP-Block]: block %3lu : %s", block1_request.number, msg_buffer);

                        // Set up block1 response option values.
                        coap_block_opt_block1_t block1_response =
                        {
                            .number = block1_request.number,
                            .more   = block1_request.more,
                            .size   = block1_request.size
                        };

                        // Encode the block1 option into a uint32_t.
                        uint32_t block1_response_encoded;
                        err_code = coap_block_opt_block1_encode(&block1_response_encoded, &block1_response);

                        // Add block1 option to the CoAP response message.
                        err_code = coap_message_opt_uint_add(p_response, COAP_OPT_BLOCK1, block1_response_encoded);

                        // Set response code according to signal if we are done, or want to continue.
                        if (block1_request.more == COAP_BLOCK_OPT_BLOCK_MORE_BIT_SET)
                        {
                            // More blocks to come.
                            p_response->header.code = COAP_CODE_231_CONTINUE;
                        }
                        else
                        {
                            APPL_LOG("[CoAP-Block]: End of block transfer");
                            // Final block.
                            p_response->header.code = COAP_CODE_204_CHANGED;
                        }
                    }
                }
            }
            break;

        default:
            {
                p_response->header.code = COAP_CODE_405_METHOD_NOT_ALLOWED;
            }
            break;
    }

    uint32_t msg_handle;
    err_code = coap_message_send(&msg_handle, p_response);
    APP_ERROR_CHECK(err_code);

    err_code = coap_message_delete(p_response);
    APP_ERROR_CHECK(err_code);
}


static void coap_endpoints_init(void)
{
    uint32_t err_code;

    static coap_resource_t root;
    err_code = coap_resource_create(&root, "/");
    APP_ERROR_CHECK(err_code);

    static coap_resource_t well_known;
    err_code = coap_resource_create(&well_known, ".well-known");
    APP_ERROR_CHECK(err_code);
    err_code = coap_resource_child_add(&root, &well_known);
    APP_ERROR_CHECK(err_code);

    static coap_resource_t core;
    err_code = coap_resource_create(&core, "core");
    APP_ERROR_CHECK(err_code);

    core.permission = COAP_PERM_GET;
    core.callback   = well_known_core_callback;

    err_code = coap_resource_child_add(&well_known, &core);
    APP_ERROR_CHECK(err_code);

    static coap_resource_t block_resource;
    err_code = coap_resource_create(&block_resource, m_resource_block_name);
    APP_ERROR_CHECK(err_code);

    block_resource.permission      = COAP_PERM_PUT;
    block_resource.callback        = large_resource_callback;
    block_resource.ct_support_mask = COAP_CT_MASK_PLAIN_TEXT;
    err_code = coap_resource_child_add(&root, &block_resource);
    APP_ERROR_CHECK(err_code);

    uint16_t size = sizeof(m_well_known_core);
    err_code = coap_resource_well_known_generate(m_well_known_core, &size);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function to handle interface up event. */
void nrf_driver_interface_up(iot_interface_t const * p_interface)
{
    UNUSED_PARAMETER(p_interface);

    APPL_LOG ("IPv6 interface up.");
#ifdef COMMISSIONING_ENABLED
    commissioning_joining_mode_timer_ctrl(JOINING_MODE_TIMER_STOP_RESET);
#endif // COMMISSIONING_ENABLED

    sys_check_timeouts();

